{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "What's Up?"
      ],
      "responses": [
        "Welcome to the Department of Technical Education, Rajasthan chatbot! How can I assist you today?",
        "Hello! I'm here to help with information about engineering and polytechnic institutes in Rajasthan. What would you like to know?",
        "Greetings! I'm your virtual assistant for technical education in Rajasthan. How may I help you?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "Thank you for using our chatbot. If you need any more information, feel free to ask anytime!",
        "Goodbye! Remember, we're here 24/7 to assist you with any queries about technical education in Rajasthan.",
        "Have a great day! Don't hesitate to return if you need more information about our institutes or programs."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": [
        "You're welcome! Is there anything else you'd like to know about our technical education programs or institutes?",
        "Glad I could help! Feel free to ask if you need more detailed information about any aspect of our educational offerings.",
        "Happy to assist! Remember, I'm here to provide comprehensive information about all engineering and polytechnic institutes under the Department of Technical Education, Rajasthan."
      ]
    },
    {
      "tag": "admissions",
      "patterns": [
        "How to apply?",
        "Application deadline?",
        "Required documents?",
        "Tell me about admissions",
        "Admission process"
      ],
      "responses": [
        "The admission process for our institutes involves online application through our centralized portal. The general application deadline is typically in June, but please check our website for exact dates. Required documents include 10+2 transcripts, domicile certificate, and category certificate (if applicable). Would you like more specific information about a particular institute?",
        "To apply, visit our official website and use the online application system. Make sure to submit before the June deadline (exact date varies annually). You'll need to upload your 10+2 marksheet, domicile certificate, and category certificate if relevant. Let me know if you need help with a specific part of the application.",
        "Our admission process is standardized across all institutes. Apply online through our portal, typically by June (check for exact dates). Prepare your 10+2 transcripts, domicile proof, and category certificate (if applicable) for upload. Do you have questions about eligibility criteria or the selection process?"
      ]
    },
    {
      "tag": "courses",
      "patterns": [
        "Available programs?",
        "Course duration?",
        "Eligibility criteria?",
        "Tell me about courses",
        "What can I study?"
      ],
      "responses": [
        "We offer a wide range of engineering and polytechnic programs across our institutes. Most B.Tech programs are 4 years long, while diploma courses are 3 years. Eligibility for B.Tech typically requires 10+2 with Physics, Chemistry, and Mathematics. For diplomas, 10th pass is usually sufficient. Would you like details about a specific program or institute?",
        "Our institutes provide various technical programs including Computer Science, Mechanical Engineering, Electrical Engineering, and more. B.Tech courses are 4-year programs, and diplomas are 3 years. For B.Tech, you need 10+2 (PCM), while diplomas require 10th pass. Any particular field you're interested in?",
        "We have numerous programs in engineering and technical fields. Course duration is 4 years for B.Tech and 3 years for diplomas. Eligibility varies: B.Tech needs 10+2 with PCM, diplomas need 10th pass. Each institute may have specific cutoffs. Would you like to know about the specializations available?"
      ]
    },
    {
      "tag": "fees",
      "patterns": [
        "Tuition fees?",
        "Payment methods?",
        "Scholarships available?",
        "Tell me about fees",
        "Fee structure"
      ],
      "responses": [
        "Fees vary by institute and program. Generally, government institutes have lower fees compared to private ones. We accept online payments, bank transfers, and demand drafts. Various scholarships are available, including merit-based, need-based, and category-specific schemes. Would you like information about fees for a particular institute or scholarship options?",
        "Our fee structure depends on the chosen institute and program. Government college fees are usually lower. Payment can be made online, via bank transfer, or demand draft. Don't forget to check our extensive scholarship offerings! Need details about a specific scholarship or institute's fees?",
        "Fees differ across institutes and programs. We have flexible payment options including online, bank transfer, and demand drafts. We also provide a range of scholarships based on merit, financial need, and categories. Shall I guide you through the scholarship application process or fee structure of a particular institute?"
      ]
    },
    {
      "tag": "placements",
      "patterns": [
        "Job opportunities?",
        "Placement records?",
        "Company recruiters?",
        "Tell me about placements",
        "Career prospects"
      ],
      "responses": [
        "Our institutes have strong placement records. Many top companies recruit from our campuses, including tech giants, manufacturing firms, and startups. Placement rates and average packages vary by institute and program. Would you like placement statistics for a specific institute or program?",
        "We pride ourselves on excellent placement opportunities. Our students are recruited by leading companies across various sectors. Placement rates and packages differ among institutes and programs. Shall I provide more details about recent placement trends or top recruiters?",
        "Career prospects for our graduates are bright. We have tie-ups with numerous companies for campus placements. The placement cell in each institute works tirelessly to ensure good opportunities. Do you want to know about the placement process or success stories of our alumni?"
      ]
    },
    {
      "tag": "facilities",
      "patterns": [
        "Campus facilities?",
        "Hostel accommodation?",
        "Sports facilities?",
        "Tell me about infrastructure",
        "Library resources"
      ],
      "responses": [
        "Our institutes are equipped with modern facilities. This includes well-stocked libraries, computer labs, workshops, and sports facilities. Most institutes offer hostel accommodation, though availability may vary. Would you like to know about the facilities at a specific institute?",
        "We ensure our students have access to quality infrastructure. This includes advanced labs, libraries with extensive resources, and sports facilities. Hostel facilities are available in most institutes. Any particular facility you're interested in knowing more about?",
        "Our campuses boast state-of-the-art facilities to support academic and extracurricular activities. From well-equipped labs to modern libraries and sports complexes, we provide a conducive environment for holistic development. Shall I elaborate on any specific aspect of our infrastructure?"
      ]
    },
    {
      "tag": "research",
      "patterns": [
        "Research opportunities?",
        "Ongoing projects?",
        "Research funding?",
        "Tell me about research",
        "Innovation initiatives"
      ],
      "responses": [
        "Research is a key focus area in our institutes. We have ongoing projects in various fields of engineering and technology. Many of our faculty members are involved in cutting-edge research. There are opportunities for students to participate in research projects. Would you like information about research in a specific field or institute?",
        "Our institutes actively promote research and innovation. We have dedicated research centers and labs for various disciplines. Students can engage in research projects under faculty guidance. There are also provisions for research funding and collaborations with industry. Any particular area of research you're curious about?",
        "We encourage a strong research culture across our institutes. This includes faculty-led projects, student research initiatives, and industry collaborations. We also organize regular seminars and workshops on emerging technologies. Shall I provide more details about our research publications or ongoing projects?"
      ]
    }
  ]
}
